open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_jpeg_decoder.c
/* SPDX-License-Identifier: Apache-2.0 */
/****************************************************************************
 * tests/modules/ap/test_bk7258_jpeg_decoder.c
 *
 * Host unit tests for chips/bk7258/ap/bk7258_jpeg_decoder.c.
 *
 * The real implementation is compiled unmodified; the immutable SDK
 * (libbk_jpeg_decoder.a) and the sys_driver interrupt-route ABI are
 * replaced by framework/mock_sdk_jpeg.c, and the NuttX cache/kmalloc/mutex
 * surface by the mocks/nuttx shims + mocks/mock_nuttx_ap.c.
 *
 * NOTE: this target is built with -no-pie.  The driver rejects any address
 * range whose final byte exceeds 32 bits (the SDK speaks to 32-bit JPEG
 * registers), so data/static buffers must live below 4 GiB on the host.
 ****************************************************************************/

#include <stdarg.h>
#include <stddef.h>
#include <setjmp.h>
#include <stdint.h>
#include <string.h>
#include <stdbool.h>
#include <errno.h>
#include <cmocka.h>

#include <nuttx/config.h>
#include <nuttx/cache.h>
#include <nuttx/mutex.h>

#include <common/bk_err.h>

#include <bk7258_jpeg_decoder.h>
#include <mock_sdk_jpeg.h>

/* JPEG bitstream builder ------------------------------------------------ */

#define JB_MAX 2048

struct jb
{
  uint8_t b[JB_MAX];
  size_t n;
};

static void jb_u8(struct jb *j, uint8_t v)
{
  assert_true(j->n < JB_MAX);
  j->b[j->n++] = v;
}

static void jb_be16(struct jb *j, uint16_t v)
{
  jb_u8(j, (uint8_t)(v >> 8));
  jb_u8(j, (uint8_t)(v & 0xffu));
}

static void jb_bytes(struct jb *j, const uint8_t *p, size_t n)
{
  assert_true(j->n + n <= JB_MAX);
  memcpy(&j->b[j->n], p, n);
  j->n += n;
}

static void jb_seg(struct jb *j, uint8_t marker, const uint8_t *payload,
                   uint16_t len)
{
  /* JPEG segment lengths include the two length bytes themselves. */
  jb_u8(j, 0xff);
  jb_u8(j, marker);
  jb_be16(j, len + 2);
  jb_bytes(j, payload, len);
}

static void jb_soi(struct jb *j)
{
  jb_u8(j, 0xff);
  jb_u8(j, 0xd8);
}

static void jb_eoi(struct jb *j)
{
  jb_u8(j, 0xff);
  jb_u8(j, 0xd9);
}

/* One DQT record: 8-bit precision, table `table`, values 1..64. */
static void jb_dqt_record(struct jb *j, uint8_t table)
{
  uint8_t rec[65];
  unsigned int i;

  rec[0] = table & 0x0fu;
  for (i = 1; i < 65; i++)
    {
      rec[i] = (uint8_t)i;
    }

  jb_bytes(j, rec, sizeof(rec));
}

static void jb_dqt(struct jb *j)
{
  struct jb seg;

  seg.n = 0;
  jb_dqt_record(&seg, 0);
  jb_dqt_record(&seg, 1);
  jb_seg(j, 0xdb, seg.b, (uint16_t)seg.n);
}

/* One minimal valid Huffman record: a single symbol of length 1. */
static void jb_dht_record(struct jb *j, uint8_t header)
{
  uint8_t rec[18];

  memset(rec, 0, sizeof(rec));
  rec[0] = header;
  if (header & 0x10)
    {
      rec[2] = 1;               /* one 2-bit symbol */
    }
  else
    {
      rec[1] = 1;               /* one 1-bit symbol */
    }

  rec[17] = 0x00;               /* symbol 0x00 */
  jb_bytes(j, rec, sizeof(rec));
}

static void jb_dht(struct jb *j)
{
  struct jb seg;

  seg.n = 0;
  jb_dht_record(&seg, 0x00);    /* DC0 */
  jb_dht_record(&seg, 0x01);    /* DC1 */
  jb_dht_record(&seg, 0x10);    /* AC0 */
  jb_dht_record(&seg, 0x11);    /* AC1 */
  jb_seg(j, 0xc4, seg.b, (uint16_t)seg.n);
}

static void jb_sof0(struct jb *j, uint16_t width, uint16_t height,
                    uint8_t y_sample)
{
  uint8_t sof[15];   /* standard SOF0 payload; segment length = 17 */

  sof[0] = 8;                   /* precision */
  sof[1] = (uint8_t)(height >> 8);
  sof[2] = (uint8_t)(height & 0xffu);
  sof[3] = (uint8_t)(width >> 8);
  sof[4] = (uint8_t)(width & 0xffu);
  sof[5] = 3;                   /* components */
  sof[6] = 1;                   /* Y id */
  sof[7] = y_sample;            /* Y sampling */
  sof[8] = 0;                   /* Y -> DQT0 */
  sof[9] = 2;                   /* Cb id */
  sof[10] = 0x11;               /* Cb sampling */
  sof[11] = 1;                  /* Cb -> DQT1 */
  sof[12] = 3;                  /* Cr id */
  sof[13] = 0x11;               /* Cr sampling */
  sof[14] = 1;                  /* Cr -> DQT1 */
  jb_seg(j, 0xc0, sof, sizeof(sof));
}

static void jb_sos(struct jb *j)
{
  uint8_t scan[10];

  scan[0] = 3;
  scan[1] = 1;
  scan[2] = 0;
  scan[3] = 2;
  scan[4] = 0x11;
  scan[5] = 3;
  scan[6] = 0x11;
  scan[7] = 0;
  scan[8] = 63;
  scan[9] = 0;
  jb_seg(j, 0xda, scan, sizeof(scan));
}

static void jb_entropy_eoi(struct jb *j)
{
  jb_eoi(j);
}

/* A complete, parser-accepted baseline stream. */
static void jb_happy(struct jb *j, uint16_t width, uint16_t height,
                     uint8_t y_sample)
{
  j->n = 0;
  jb_soi(j);
  jb_dqt(j);
  jb_dht(j);
  jb_sof0(j, width, height, y_sample);
  jb_sos(j);
  jb_entropy_eoi(j);
}

/* A happy stream with `app_segs` APP15 segments in the header (after DHT).
 * Header segments are parse-valid anywhere before SOS, so the stream length
 * can be grown without touching the entropy tail.
 */
static void jb_happy_app(struct jb *j, uint16_t width, uint16_t height,
                         uint8_t y_sample, size_t app_segs)
{
  uint8_t fill[64];
  size_t i;

  memset(fill, 0x11, sizeof(fill));
  j->n = 0;
  jb_soi(j);
  jb_dqt(j);
  jb_dht(j);
  for (i = 0; i < app_segs; i++)
    {
      jb_seg(j, 0xef, fill, sizeof(fill));
    }

  jb_sof0(j, width, height, y_sample);
  jb_sos(j);
  jb_entropy_eoi(j);
}

/* Test scaffolding ------------------------------------------------------ */

#define SAMPLE_444 0x11u
#define SAMPLE_422 0x21u
#define SAMPLE_420 0x22u
#define INTR_BIT   (1u << 26)
#define CORE_CPU1  1u
#define CORE_CPU2  2u

static struct jb g_jb;
static uint8_t g_out[4096] __attribute__((aligned(64)));
static uint8_t g_small[16];
static struct bk7258_jpeg_decoder_s *s_owner;

static int t_setup(void **state)
{
  mock_jpeg_sdk_reset();
  mock_cache_set_linesize(0);
  mock_mutex_fail_next(0);
  memset(&g_mock_cache_clean, 0, sizeof(g_mock_cache_clean));
  memset(&g_mock_cache_flush, 0, sizeof(g_mock_cache_flush));
  memset(&g_mock_cache_invalidate, 0, sizeof(g_mock_cache_invalidate));
  s_owner = NULL;
  return 0;
}

