open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_jpeg_decoder.c
static int t_teardown(void **state)
{
  if (s_owner != NULL)
    {
      mock_jpeg_sdk_reset();
      assert_int_equal(bk7258_jpeg_decoder_uninitialize(s_owner), 0);
      s_owner = NULL;
    }

  return 0;
}

static void assert_route_cpu1(void)
{
  /* open() then disable(CPU2)+enable(CPU1). */
  assert_int_equal(g_mock_sys_disable_calls, 1);
  assert_int_equal(g_mock_sys_disable_cores[0], CORE_CPU2);
  assert_int_equal(g_mock_sys_disable_params[0], INTR_BIT);
  assert_int_equal(g_mock_sys_enable_calls, 1);
  assert_int_equal(g_mock_sys_enable_cores[0], CORE_CPU1);
  assert_int_equal(g_mock_sys_enable_params[0], INTR_BIT);
}

/* Initialize ------------------------------------------------------------ */

static void test_init_null_out(void **state)
{
  assert_int_equal(bk7258_jpeg_decoder_initialize(NULL), -EINVAL);
}

static void test_init_ok(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  assert_non_null(out);
  s_owner = out;
  assert_int_equal(g_mock_new_calls.count, 1);
  assert_int_equal(g_mock_open_calls.count, 1);
  assert_route_cpu1();
}

static void test_init_second_busy(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;

  out = (struct bk7258_jpeg_decoder_s *)(uintptr_t)1;
  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), -EBUSY);
  /* The driver always clears *out before consulting the owner. */
  assert_null(out);
  assert_int_equal(g_mock_new_calls.count, 1);
}

static void test_init_new_inval(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;

  mock_jpeg_sdk_set_new(AVDK_ERR_INVAL, (void *)(uintptr_t)0x1000);
  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), -EINVAL);
  assert_null(out);
  assert_int_equal(g_mock_delete_calls.count, 1);
}

static void test_init_new_ok_null_handle(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;

  mock_jpeg_sdk_set_new(AVDK_ERR_OK, NULL);
  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), -EIO);
  assert_null(out);
  /* handle is NULL: nothing to delete, no orphan. */
  assert_int_equal(g_mock_delete_calls.count, 0);
}

static void test_init_new_fail_delete_fail_orphan(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_s *first;

  mock_jpeg_sdk_set_new(AVDK_ERR_HWERROR, (void *)(uintptr_t)0x1000);
  mock_jpeg_sdk_set_delete(AVDK_ERR_SHUTDOWN);
  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), -ESHUTDOWN);
  assert_non_null(out);
  s_owner = out;
  first = out;
  assert_int_equal(g_mock_delete_calls.count, 1);

  /* The original caller lost the handle: a later initialize must hand it
   * back together with -EIO instead of constructing a second instance. */
  out = NULL;
  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), -EIO);
  assert_ptr_equal(out, first);
  assert_int_equal(g_mock_new_calls.count, 1);
}

static void test_init_open_timeout(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;

  mock_jpeg_sdk_set_open(AVDK_ERR_TIMEOUT);
  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), -ETIMEDOUT);
  assert_null(out);
  assert_int_equal(g_mock_open_calls.count, 1);
  assert_int_equal(g_mock_delete_calls.count, 1);
  assert_int_equal(g_mock_sys_enable_calls, 0);
}

static void test_init_open_fail_delete_fail_orphan(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;

  mock_jpeg_sdk_set_open(AVDK_ERR_BUSY);
  mock_jpeg_sdk_set_delete(AVDK_ERR_BUSY);
  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), -EBUSY);
  assert_non_null(out);
  s_owner = out;

  /* orphan is not opened: uninitialize skips close and retries delete. */
  assert_int_equal(g_mock_close_calls.count, 0);
  assert_int_equal(g_mock_delete_calls.count, 1);
}

static void test_init_route_fail(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;

  mock_jpeg_sdk_set_sys_enable(1);
  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), -EIO);
  assert_null(out);

  assert_int_equal(g_mock_sys_disable_calls, 2);
  assert_int_equal(g_mock_sys_disable_cores[0], CORE_CPU2);
  assert_int_equal(g_mock_sys_disable_cores[1], CORE_CPU1);
  assert_int_equal(g_mock_close_calls.count, 1);
  assert_int_equal(g_mock_delete_calls.count, 1);
}

static void test_init_route_fail_close_fail(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;

  mock_jpeg_sdk_set_sys_enable(1);
  mock_jpeg_sdk_set_close(AVDK_ERR_BUSY);
  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), -EBUSY);
  assert_non_null(out);
  s_owner = out;

  /* Retained as an open orphan: uninitialize retries close then delete. */
  assert_int_equal(g_mock_close_calls.count, 1);
  assert_int_equal(g_mock_delete_calls.count, 0);
}

static void test_init_route_fail_delete_fail(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;

  mock_jpeg_sdk_set_sys_enable(1);
  mock_jpeg_sdk_set_delete(AVDK_ERR_BUSY);
  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), -EBUSY);
  assert_non_null(out);
  s_owner = out;

  assert_int_equal(g_mock_close_calls.count, 1);
  /* closed, then delete failed: orphan stays. */
  assert_int_equal(g_mock_delete_calls.count, 1);
}

static void test_init_lock_fail(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;

  mock_mutex_fail_next(1);
  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), -EAGAIN);
  assert_int_equal(g_mock_new_calls.count, 0);
}

/* Uninitialize ---------------------------------------------------------- */

static void test_uninit_null(void **state)
{
  assert_int_equal(bk7258_jpeg_decoder_uninitialize(NULL), -EINVAL);
}

static void test_uninit_not_owner(void **state)
{
  char junk[16];

  assert_int_equal(
    bk7258_jpeg_decoder_uninitialize(
      (FAR struct bk7258_jpeg_decoder_s *)(void *)junk), -EINVAL);
}

static void test_uninit_ok(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_uninitialize(out), 0);
  s_owner = NULL;

  assert_int_equal(g_mock_close_calls.count, 1);
  assert_int_equal(g_mock_sys_disable_calls, 2);   /* CPU2 then CPU1 */
  assert_int_equal(g_mock_sys_disable_cores[1], CORE_CPU1);
  assert_int_equal(g_mock_delete_calls.count, 1);

  /* Stale-handle use after teardown. */
  assert_int_equal(bk7258_jpeg_decoder_uninitialize(out), -EINVAL);
}

static void test_uninit_close_fail_retry(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;

  mock_jpeg_sdk_set_close(AVDK_ERR_BUSY);
  assert_int_equal(bk7258_jpeg_decoder_uninitialize(out), -EBUSY);
  assert_int_equal(g_mock_close_calls.count, 1);
  assert_int_equal(g_mock_delete_calls.count, 0);

  /* Ownership was kept: retry completes once the SDK recovers. */
  mock_jpeg_sdk_set_close(AVDK_ERR_OK);
  assert_int_equal(bk7258_jpeg_decoder_uninitialize(out), 0);
  s_owner = NULL;
  assert_int_equal(g_mock_close_calls.count, 2);
  assert_int_equal(g_mock_delete_calls.count, 1);
}

static void test_uninit_delete_fail_blocks_reinit(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_s *saved;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  saved = out;

  mock_jpeg_sdk_set_delete(AVDK_ERR_BUSY);
  assert_int_equal(bk7258_jpeg_decoder_uninitialize(saved), -EBUSY);

  /* A delete-failed owner blocks new instances until uninitialize retried.
   * initialize always clears *out on this path, so use the saved handle. */
  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), -EBUSY);
  assert_null(out);

