open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_jpeg_decoder.c
  mock_jpeg_sdk_set_delete(AVDK_ERR_OK);
  assert_int_equal(bk7258_jpeg_decoder_uninitialize(saved), 0);
  s_owner = NULL;
  assert_int_equal(g_mock_delete_calls.count, 2);
}

/* get_info: ownership gating ------------------------------------------- */

static void test_getinfo_null_info(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, NULL), -EINVAL);
}

static void test_getinfo_not_owner(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_get_info(NULL, &in, &info),
                   -EINVAL);

  /* Bogus non-owner pointer. */
  assert_int_equal(
    bk7258_jpeg_decoder_get_info(
      (FAR struct bk7258_jpeg_decoder_s *)(uintptr_t)0x1234, &in, &info),
    -ENODEV);
}

/* get_info: parser ------------------------------------------------------ */

static void test_parse_444(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;
  int ret;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  ret = bk7258_jpeg_decoder_get_info(out, &in, &info);
  assert_int_equal(ret, 0);
  assert_int_equal(info.width, 3);
  assert_int_equal(info.height, 3);
  assert_int_equal(info.format, BK7258_JPEG_DECODER_YUV444);
}

static void test_parse_422(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 16, 8, SAMPLE_422);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), 0);
  assert_int_equal(info.width, 16);
  assert_int_equal(info.height, 8);
  assert_int_equal(info.format, BK7258_JPEG_DECODER_YUV422);
}

static void test_parse_420(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 640, 480, SAMPLE_420);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), 0);
  assert_int_equal(info.width, 640);
  assert_int_equal(info.height, 480);
  assert_int_equal(info.format, BK7258_JPEG_DECODER_YUV420);
}

static void test_parse_no_soi(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  g_jb.n = 0;
  jb_u8(&g_jb, 0x00);
  jb_u8(&g_jb, 0x00);
  jb_eoi(&g_jb);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), -EINVAL);
}

static void test_parse_soi_only(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  g_jb.n = 0;
  jb_soi(&g_jb);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), -EINVAL);
}

static void test_parse_trailing_prefix(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  g_jb.n = 0;
  jb_soi(&g_jb);
  jb_u8(&g_jb, 0xff);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), -EINVAL);
}

static void test_parse_sof1_rejected(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;
  uint8_t sof[17];

  memset(sof, 0, sizeof(sof));
  sof[0] = 8;
  sof[5] = 1;
  g_jb.n = 0;
  jb_soi(&g_jb);
  jb_seg(&g_jb, 0xc1, sof, sizeof(sof));
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_sof0_bad_precision(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  /* SOF payload: SOI(2)+DQT seg(133)+DHT seg(77)+SOF len(3) -> 215. */
  g_jb.b[215 + 1] = 12;
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_sof0_bad_components(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[215 + 6] = 2;   /* SOF ncomp */
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_sof0_zero_dims(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[215 + 2] = 0;   /* SOF height hi */
  g_jb.b[215 + 3] = 0;   /* SOF height lo */
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), -EINVAL);
}

static void test_parse_sof0_dup_ids(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[215 + 10] = 1;   /* Cb id == Y id */
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

