open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_jpeg_decoder.c
static void test_parse_sof0_bad_ysample(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[215 + 8] = 0x12;   /* Y sampling */
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_sof0_bad_chroma_sample(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[215 + 12] = 0x22;   /* Cb v-factor */
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_sof0_twice(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  g_jb.n = 0;   /* two SOF0 segments before the single scan */
  jb_soi(&g_jb);
  jb_dqt(&g_jb);
  jb_dht(&g_jb);
  jb_sof0(&g_jb, 3, 3, SAMPLE_444);
  jb_sof0(&g_jb, 3, 3, SAMPLE_444);
  jb_sos(&g_jb);
  jb_entropy_eoi(&g_jb);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_dqt_pq_nonzero(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  /* First DQT record (payload starts at byte 6): pq=1. */
  g_jb.b[6] = 0x10;
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_dqt_table2(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[6] = 0x02;
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_dqt_dup_table(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[6 + 65] = 0x00;   /* second record repeats table 0 */
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_dqt_length_bad(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;
  uint8_t empty[2] = {0, 0};

  g_jb.n = 0;
  jb_soi(&g_jb);
  jb_seg(&g_jb, 0xdb, empty, sizeof(empty));
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), -EINVAL);
}

static void test_parse_dqt_zero_value(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[6 + 1] = 0;
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), -EINVAL);
}

static void test_parse_dht_class2(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  /* First DHT record header (SOI 2 + DQT seg 133 + DHT len 2). */
  g_jb.b[140] = 0x20;
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_dht_overflow_counts(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[141] = 2;   /* DC0: two 1-bit symbols */
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_dht_zero_symbols(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[141] = 0;   /* DC0: no symbols */
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_dht_dc_symbol_too_big(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  /* DC0 symbol slot: header(1)+counts(16)=17 bytes into DHT payload. */
  g_jb.b[140 + 17] = 12;
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_dht_ac_size_11(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  /* AC0 symbol slot: DC0(18)+DC1(18)+header(1)+counts(16)=53. */
  g_jb.b[140 + 53] = 0x1b;   /* run=1, size=11 */
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

