open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_jpeg_decoder.c
static void test_parse_dht_ac_odd_zero(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[140 + 53] = 0x10;   /* run=1, size=0 */
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_dht_dup_symbol(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[142] = 1;   /* DC0: two 1-bit symbols (one at len 1, one at len 2) */
  g_jb.b[140 + 17] = 0;  /* both 0x00 -> duplicate */
  g_jb.b[140 + 18] = 0;
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), -EINVAL);
}

static void test_parse_dht_dup_table(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[158] = 0x00;   /* DC1 record header -> repeats DC0 table */
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_sos_before_sof(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  g_jb.n = 0;
  jb_soi(&g_jb);
  jb_dqt(&g_jb);
  jb_dht(&g_jb);
  jb_sos(&g_jb);
  jb_entropy_eoi(&g_jb);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), -EINVAL);
}

static void test_parse_missing_dqt(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  g_jb.n = 0;
  jb_soi(&g_jb);
  jb_dht(&g_jb);
  jb_sof0(&g_jb, 3, 3, SAMPLE_444);
  jb_sos(&g_jb);
  jb_entropy_eoi(&g_jb);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_scan_mismatch_ids(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.b[235 + 1] = 99;   /* SOS first id */
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_scan_mismatch_tables(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  /* ysel first scan byte: must be 0. */
  g_jb.b[235 + 2] = 1;
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_no_eoi(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.n -= 2;   /* drop EOI */
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), -EINVAL);
}

static void test_parse_trailing_after_eoi(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  jb_u8(&g_jb, 0x00);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), -EINVAL);
}

static void test_parse_marker_in_entropy(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;
  uint8_t ext[4];

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  /* Replace entropy EOI with a mid-scan DHT marker: reject. */
  ext[0] = 0xff;
  ext[1] = 0xc4;
  ext[2] = 0x00;
  ext[3] = 0x00;
  memcpy(&g_jb.b[g_jb.n - 2], ext, sizeof(ext));
  g_jb.b[g_jb.n + 2] = 0;
  g_jb.n += 2;
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info),
                   -ENOTSUP);
}

static void test_parse_stuff_restart_then_eoi(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  g_jb.n -= 2;   /* drop the base EOI, then re-emit entropy below */
  /* Entropy: 0xff 0x00 fill, 0xff 0xd0 restart, then EOI. */
  jb_u8(&g_jb, 0xff);
  jb_u8(&g_jb, 0x00);
  jb_u8(&g_jb, 0xff);
  jb_u8(&g_jb, 0xd0);
  jb_eoi(&g_jb);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), 0);
}

static void test_parse_header_segments_app_com_dri(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_info_s info;
  struct bk7258_jpeg_decoder_s *out = NULL;
  uint8_t app[16];
  uint8_t com[4] = {0x68, 0x69, 0x21, 0x21};
  uint8_t dri[2] = {0x00, 0x02};

