open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_jpeg_decoder.c
  memset(app, 0x55, sizeof(app));
  g_jb.n = 0;
  jb_soi(&g_jb);
  jb_seg(&g_jb, 0xe0, app, sizeof(app));
  jb_seg(&g_jb, 0xfe, com, sizeof(com));
  jb_dqt(&g_jb);
  jb_dht(&g_jb);
  jb_sof0(&g_jb, 3, 3, SAMPLE_444);
  jb_seg(&g_jb, 0xdd, dri, sizeof(dri));
  jb_sos(&g_jb);
  jb_entropy_eoi(&g_jb);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), 0);
  assert_int_equal(info.format, BK7258_JPEG_DECODER_YUV444);
}

/* Decode: descriptor validation ---------------------------------------- */

static void test_decode_validation_ladder(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_frame_s out_f;
  struct bk7258_jpeg_decoder_frame_s saved;
  int ret;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_out;
  out_f.capacity = sizeof(g_out);

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  saved = in;

  /* NULL input / empty descriptors. */
  ret = bk7258_jpeg_decoder_decode(out, NULL, &out_f);
  assert_int_equal(ret, -EINVAL);
  assert_int_equal(out_f.length, 0);

  in.data = NULL;
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EINVAL);
  in = saved;

  in.length = 0;
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EINVAL);
  in = saved;

  in.capacity = 0;
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EINVAL);
  in = saved;

  in.length = in.capacity + 1;
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EINVAL);
  in = saved;

  /* Output descriptor. */
  out_f.data = NULL;
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EINVAL);
  out_f.data = g_out;

  out_f.capacity = 0;
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EINVAL);
  out_f.capacity = sizeof(g_out);

  /* 32-bit address contract. */
  in.data = (FAR uint8_t *)((uintptr_t)0x1ull << 32);
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f),
                   -EOVERFLOW);
  in = saved;

  in.data = (FAR uint8_t *)(UINTPTR_MAX - 3);
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f),
                   -EOVERFLOW);
  in = saved;

  out_f.data = (FAR uint8_t *)((uintptr_t)0x1ull << 32);
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f),
                   -EOVERFLOW);
  assert_int_equal(out_f.length, 0);
  out_f.data = g_out;

  /* Overlap. */
  in.data = g_out;
  in.capacity = sizeof(g_out);
  in.length = in.capacity;
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EINVAL);
  in = saved;

  assert_int_equal(g_mock_decode_calls, 0);
}

static void test_decode_not_owner(void **state)
{
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_frame_s out_f;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_out;
  out_f.capacity = sizeof(g_out);

  assert_int_equal(
    bk7258_jpeg_decoder_decode(
      (FAR struct bk7258_jpeg_decoder_s *)(uintptr_t)0x1234, &in, &out_f),
    -ENODEV);

  assert_int_equal(bk7258_jpeg_decoder_decode(NULL, &in, &out_f), -EINVAL);
  assert_int_equal(g_mock_decode_calls, 0);
}

static void test_decode_lock_fail(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_frame_s out_f;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_out;
  out_f.capacity = sizeof(g_out);

  mock_mutex_fail_next(1);
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EAGAIN);
  assert_int_equal(g_mock_decode_calls, 0);
}

static void test_decode_ok_default_cache(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_frame_s out_f;
  frame_buffer_t sdk_in;
  frame_buffer_t sdk_out;
  uintptr_t guarded;
  uintptr_t rounded;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_out;
  out_f.capacity = sizeof(g_out);

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  mock_jpeg_sdk_set_decode_image(3, 3);

  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), 0);

  /* Snapshot the SDK frame descriptors immediately: they live in the
   * driver's dead stack frame and later calls would reuse that memory. */
  sdk_in = *g_mock_decode_in;
  sdk_out = *g_mock_decode_out;

  assert_int_equal(out_f.length, 3 * 3 * 2);
  assert_int_equal(out_f.width, 3);
  assert_int_equal(out_f.height, 3);
  assert_int_equal(in.width, 3);
  assert_int_equal(in.height, 3);
  assert_int_equal(g_mock_decode_calls, 1);

  /* The SDK never sees the caller's input buffer: it receives the
   * guarded bounce. */
  assert_int_not_equal((uintptr_t)sdk_in.frame, (uintptr_t)g_jb.b);
  guarded = (uintptr_t)g_jb.n + 2048;
  rounded = (guarded + 7) & ~(uintptr_t)7;
  assert_int_equal(sdk_in.length, (uint32_t)g_jb.n);
  assert_int_equal(sdk_in.size, (uint32_t)rounded);
  assert_int_equal(sdk_in.fmt, PIXEL_FMT_JPEG);
  assert_int_equal(sdk_in.width, 3);
  assert_int_equal(sdk_in.height, 3);

  assert_int_equal((uintptr_t)sdk_out.frame, (uintptr_t)g_out);
  assert_int_equal(sdk_out.size, sizeof(g_out));
  assert_int_equal(sdk_out.fmt, PIXEL_FMT_YUYV);

  /* Cache maintenance around the transfer. */
  assert_int_equal(g_mock_cache_clean.count, 1);
  assert_int_equal(g_mock_cache_clean.end[0] - g_mock_cache_clean.start[0],
                   guarded);
  assert_int_equal(g_mock_cache_flush.count, 1);
  assert_int_equal(g_mock_cache_flush.start[0], (uintptr_t)g_out);
  assert_int_equal(g_mock_cache_flush.end[0] - g_mock_cache_flush.start[0],
                   24);   /* 18-byte payload on 8-byte lines */
  assert_int_equal(g_mock_cache_invalidate.count, 1);
  assert_int_equal(g_mock_cache_invalidate.end[0] -
                     g_mock_cache_invalidate.start[0], 24);
}

static void test_decode_ok_line64(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_frame_s out_f;
  uintptr_t guarded;

