open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_jpeg_decoder.c
  mock_cache_set_linesize(64);

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_out;
  out_f.capacity = sizeof(g_out);

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  mock_jpeg_sdk_set_decode_image(3, 3);

  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), 0);

  guarded = (uintptr_t)g_jb.n + 2048;
  /* The clean span is the unrounded guarded size; the output span is a
   * whole number of 64-byte lines. */
  assert_int_equal(g_mock_cache_clean.end[0] - g_mock_cache_clean.start[0],
                   guarded);
  assert_int_equal(g_mock_cache_flush.end[0] - g_mock_cache_flush.start[0],
                   64);
  assert_int_equal(g_mock_cache_invalidate.end[0] -
                     g_mock_cache_invalidate.start[0], 64);
}

static void test_decode_unaligned_line64(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_frame_s out_f;

  mock_cache_set_linesize(64);

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_out + 8;
  out_f.capacity = sizeof(g_out) - 8;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;

  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EINVAL);
  assert_int_equal(g_mock_decode_calls, 0);
}

static void test_decode_non_power_of_two_line(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_frame_s out_f;

  mock_cache_set_linesize(3);

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_out;
  out_f.capacity = sizeof(g_out);

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;

  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EIO);
  assert_int_equal(g_mock_decode_calls, 0);
}

static void test_decode_enospc_small_buf(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_frame_s out_f;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_small;
  out_f.capacity = 4;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;

  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -ENOSPC);
  assert_int_equal(out_f.length, 0);
  assert_int_equal(g_mock_decode_calls, 0);

  /* Not faulted: a larger buffer decodes fine. */
  out_f.data = g_out;
  out_f.capacity = sizeof(g_out);
  mock_jpeg_sdk_set_decode_image(3, 3);
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), 0);
}

static void test_decode_enospc_rounded_span(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_frame_s out_f;

  mock_cache_set_linesize(64);

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_out;
  out_f.capacity = 63;   /* payload 18 fits but 64-byte span does not */

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;

  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -ENOSPC);
  assert_int_equal(g_mock_decode_calls, 0);
}

static void test_decode_sdk_error_faults(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_frame_s out_f;
  struct bk7258_jpeg_decoder_info_s info;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_out;
  out_f.capacity = sizeof(g_out);

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  mock_jpeg_sdk_set_decode_image(3, 3);
  mock_jpeg_sdk_set_decode(AVDK_ERR_HWERROR);

  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EIO);
  assert_int_equal(out_f.length, 0);
  assert_int_equal(g_mock_decode_calls, 1);

  /* The handle is faulted: no further SDK traffic. */
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EIO);
  assert_int_equal(g_mock_decode_calls, 1);
  assert_int_equal(bk7258_jpeg_decoder_get_info(out, &in, &info), -EIO);

  /* A fresh generation works again. */
  mock_jpeg_sdk_reset();
  mock_jpeg_sdk_set_decode_image(3, 3);
  assert_int_equal(bk7258_jpeg_decoder_uninitialize(out), 0);
  s_owner = NULL;

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), 0);
}

static void test_decode_sdk_timeout_faults(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_frame_s out_f;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_out;
  out_f.capacity = sizeof(g_out);

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  mock_jpeg_sdk_set_decode(BK_ERR_TIMEOUT);

  /* The SDK timeout surfaces as its hardware-error status: -EIO. */
  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EIO);
  assert_int_equal(out_f.length, 0);
}

static void test_decode_dims_mismatch_faults(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_frame_s out_f;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);
  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_out;
  out_f.capacity = sizeof(g_out);

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  mock_jpeg_sdk_set_decode_image(4, 3);

  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), -EIO);
  assert_int_equal(out_f.length, 0);
  assert_int_equal(in.width, 0);
  assert_int_equal(in.height, 0);
}

