open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_jpeg_decoder.c
static void test_decode_bounce_grow(void **state)
{
  struct bk7258_jpeg_decoder_s *out = NULL;
  struct bk7258_jpeg_decoder_frame_s in;
  struct bk7258_jpeg_decoder_frame_s out_f;
  static struct jb longer;
  frame_buffer_t sdk_in;

  jb_happy(&g_jb, 3, 3, SAMPLE_444);

  memset(&in, 0, sizeof(in));
  in.data = g_jb.b;
  in.capacity = (uint32_t)g_jb.n;
  in.length = (uint32_t)g_jb.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_out;
  out_f.capacity = sizeof(g_out);

  assert_int_equal(bk7258_jpeg_decoder_initialize(&out), 0);
  s_owner = out;
  mock_jpeg_sdk_set_decode_image(3, 3);

  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), 0);
  sdk_in = *g_mock_decode_in;
  assert_int_equal(sdk_in.size,
                   (uint32_t)((((uintptr_t)g_jb.n + 2048) + 7) & ~(uintptr_t)7));

  /* A longer, still parse-valid stream forces the bounce to grow. */
  jb_happy_app(&longer, 3, 3, SAMPLE_444, 2);
  assert_true(longer.n > g_jb.n);
  memset(&in, 0, sizeof(in));
  in.data = longer.b;
  in.capacity = (uint32_t)longer.n;
  in.length = (uint32_t)longer.n;
  memset(&out_f, 0, sizeof(out_f));
  out_f.data = g_out;
  out_f.capacity = sizeof(g_out);

  assert_int_equal(bk7258_jpeg_decoder_decode(out, &in, &out_f), 0);
  sdk_in = *g_mock_decode_in;
  assert_int_equal(sdk_in.size,
                   (uint32_t)((((uintptr_t)longer.n + 2048) + 7) & ~(uintptr_t)7));
}

/* Suite ----------------------------------------------------------------- */

int main(void)
{
  const struct CMUnitTest tests[] = {
    cmocka_unit_test_setup_teardown(test_init_null_out, t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_init_ok, t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_init_second_busy, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_init_new_inval, t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_init_new_ok_null_handle, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_init_new_fail_delete_fail_orphan,
                                    t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_init_open_timeout, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_init_open_fail_delete_fail_orphan,
                                    t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_init_route_fail, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_init_route_fail_close_fail, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_init_route_fail_delete_fail, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_init_lock_fail, t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_uninit_null, t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_uninit_not_owner, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_uninit_ok, t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_uninit_close_fail_retry, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_uninit_delete_fail_blocks_reinit,
                                    t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_getinfo_null_info, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_getinfo_not_owner, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_444, t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_422, t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_420, t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_no_soi, t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_soi_only, t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_trailing_prefix, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_sof1_rejected, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_sof0_bad_precision, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_sof0_bad_components, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_sof0_zero_dims, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_sof0_dup_ids, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_sof0_bad_ysample, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_sof0_bad_chroma_sample,
                                    t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_sof0_twice, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_dqt_pq_nonzero, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_dqt_table2, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_dqt_dup_table, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_dqt_length_bad, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_dqt_zero_value, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_dht_class2, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_dht_overflow_counts, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_dht_zero_symbols, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_dht_dc_symbol_too_big, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_dht_ac_size_11, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_dht_ac_odd_zero, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_dht_dup_symbol, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_dht_dup_table, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_sos_before_sof, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_missing_dqt, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_scan_mismatch_ids, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_scan_mismatch_tables, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_no_eoi, t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_trailing_after_eoi, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_marker_in_entropy, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_stuff_restart_then_eoi, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_parse_header_segments_app_com_dri,
                                    t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_decode_validation_ladder, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_decode_not_owner, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_decode_lock_fail, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_decode_ok_default_cache, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_decode_ok_line64, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_decode_unaligned_line64, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_decode_non_power_of_two_line,
                                    t_setup, t_teardown),
    cmocka_unit_test_setup_teardown(test_decode_enospc_small_buf, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_decode_enospc_rounded_span, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_decode_sdk_error_faults, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_decode_sdk_timeout_faults, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_decode_dims_mismatch_faults, t_setup,
                                    t_teardown),
    cmocka_unit_test_setup_teardown(test_decode_bounce_grow, t_setup,
                                    t_teardown),
  };

  return cmocka_run_group_tests(tests, NULL, NULL);
}
